package Type_Daten;

public class Компонентысигнатурыметода {

    //     Имя метода: Уникальное имя, с помощью которого метод будет вызываться.
    //    Параметры: Типы и порядок параметров, которые метод принимает.
    //
    //Пример сигнатуры метода:
    //
    //java
    //
    //public int add(int a, int b) {
    //    return a + b;
    //}
    //
    //    В этом примере:
    //        Имя метода: add
    //        Параметры: (int a, int b)
    //
    //Сигнатуры и перегрузка методов:
    //
    //Если у нас есть несколько методов с одним и тем же именем, но разными параметрами, это разные сигнатуры:
    //
    //java
    //
    //public int add(int a, int b) { // Сигнатура 1
    //    return a + b;
    //}
    //
    //public double add(double a, double b) { // Сигнатура 2
    //    return a + b;
    //}
    //
    //public int add(int a, int b, int c) { // Сигнатура 3
    //    return a + b + c;
    //}
    //
    //    В этом примере три метода с именем add, но у них разные сигнатуры из-за различных типов и количества параметров.
    //
    //Что не входит в сигнатуру:
    //
    //    Возвращаемый тип метода (например, int в нашем первом примере).
    //    Модификаторы доступа (например, public, private).
    //    Исключения, которые может выбрасывать метод.


}
